app/controllers/tasks_controller.rb

SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
  def show
    task_id = params[:id]
    @task = Task.find_by(id: task_id)

INSERT INTO "tasks" ("name", "description", "due_date", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "Rails"], ["description", "Learn Rails"], ["due_date", "2020-01-01"], ["created_at", "2019-10-04 15:25:32.926082"], ["updated_at", "2019-10-04 15:25:32.926082"]]
---
  def create
    @task = Task.new(task_params)#Task.new(name: params[:task][:name], description: params[:task][:description], due_date: params[:task][:due_date], completion_date: nil) #instantiate a new task
    if @task.save # save returns true if the database insert succeeds

SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "tasks" SET "due_date" = $1, "updated_at" = $2 WHERE "tasks"."id" = $3  [["due_date", "2020-01-02"], ["updated_at", "2019-10-04 00:17:52.072937"], ["id", 1]]
---
  def update
    @task = Task.find(params[:id])

    @task.update(name: params[:task][:name], description: params[:task][:description], due_date: params[:task][:due_date], completion_date: nil)

SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
DELETE FROM "tasks" WHERE "tasks"."id" = $1  [["id", 2]]
---
  def destroy
    task_id = params[:id]
    @task = Task.find_by(id:task_id)

    if @task.nil?
      head :not_found
      return
    end

    @task.destroy

SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
UPDATE "tasks" SET "completion_date" = $1, "updated_at" = $2 WHERE "tasks"."id" = $3  [["completion_date", "2019-10-04 16:54:38.623739"], ["updated_at", "2019-10-04 16:54:38.625392"], ["id", 4]]
---
  def mark_complete
    task_id = params[:id]
    @task = Task.find_by(id:task_id)

    puts "task: #{@task}"

    if @task.nil?
      head :not_found
      return
    end

    @task.completion_date = Time.now
    @task.save

SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
UPDATE "tasks" SET "completion_date" = $1, "updated_at" = $2 WHERE "tasks"."id" = $3  [["completion_date", nil], ["updated_at", "2019-10-04 16:55:20.336584"], ["id", 4]]
---
  def mark_incomplete
    task_id = params[:id]
    @task = Task.find_by(id:task_id)

    if @task.nil?
      head :not_found
      return
    end

    @task.completion_date = nil
    @task.save